modules/gateway/server/src/test/resources/com/l7tech/server/admin/MigrationApi_RetrieveMappingCandidatesRequest.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <ns2:RetrieveMappingCandidates xmlns:ns2="http://www.layer7tech.com/management/migration"
                                       xmlns:ns3="http://ns.l7tech.com/secureSpan/1.0/core">
            <ExternalEntityHeaders oid="-1" type="ANY">
                <description></description>
                <extraProperties/>
            </ExternalEntityHeaders>
            <ExternalEntityHeaders oid="-1" type="ANY">
                <description></description>
                <extraProperties/>
            </ExternalEntityHeaders>
            <Scope oid="-1" type="ANY">
                <description></description>
                <extraProperties/>
            </Scope>
            <Filter>
                <entry>
                    <key xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                         xmlns:ns5="http://www.w3.org/2001/XMLSchema" xsi:type="ns5:string">a
                    </key>
                    <value xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                           xmlns:ns5="http://www.w3.org/2001/XMLSchema" xsi:type="ns5:string">b
                    </value>
                </entry>
            </Filter>
        </ns2:RetrieveMappingCandidates>
    </soap:Body>
</soap:Envelope>